// Вычисляет сумму первых п целых положительных чисел
#include <stdio.h>
#include <conio.h>
void mainO
{
int n; // кол-во суммируемых чисел
int summ; // сумма
int i; // счетчик циклов
printf("Вычисление суммы положительных чисел\п");
printf("Введите количество суммируемых чисел -> " );
scanf("%i", &n);
sujxm = 0;
for (i = 1; i <= n; i++)
summ = summ+i;
printf("Сумма первых %i целых положительных чисел ",n);
printf("равна %i", summ);
p r i n t f ( " \ п \ п Д л я завершения нажмите <Enter>");
g e t c h ( ) ;
}